MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\USBUART.h
/*******************************************************************************
* File Name: USBUART.h
* Version 0.0
*
*  Description:
*    Header File for the USFS component. Contains prototypes and constant values. 
*
********************************************************************************
* Copyright 2008-2009, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/


#if !defined(USBUART_H)
#define USBUART_H

#include "cytypes.h"

#if(CYDEV_CHIP_DIE_EXPECT == CYDEV_CHIP_DIE_LEOPARD)     
    #if(CYDEV_CHIP_REV_EXPECT <= CYDEV_CHIP_REV_LEOPARD_ES2)      
        #include <intrins.h>
        #define USBUART_ISR_PATCH() _nop_(); _nop_(); _nop_(); _nop_(); _nop_(); _nop_(); _nop_(); _nop_();
    #endif
#endif    

/************************************************
 *  General defines 
 ************************************************/
#if defined(__C51__) || defined(__CX51__)
#ifndef USBUART_CODE
#define USBUART_CODE code
#define USBUART_DATA data
#define USBUART_XDATA xdata
#define USBUART_FAR far
#define USBUART_NULL  ((void *) 0)
#endif
#else
#ifndef USBUART_CODE
#define USBUART_CODE
#define USBUART_DATA
#define USBUART_XDATA
#define USBUART_FAR
#define USBUART_NULL  ((void *) 0)
#endif
#endif

/************************************************
 *  Customizer Defines 
 ************************************************/

#define USBUART_MON_VBUS                   0
#define USBUART_EP0_ISR_REMOVE             0
#define USBUART_EP1_ISR_REMOVE             0
#define USBUART_EP2_ISR_REMOVE             0
#define USBUART_EP3_ISR_REMOVE             0
#define USBUART_EP4_ISR_REMOVE             0
#define USBUART_EP5_ISR_REMOVE             0
#define USBUART_EP6_ISR_REMOVE             0
#define USBUART_EP7_ISR_REMOVE             0
#define USBUART_EP8_ISR_REMOVE             0
#if (USBUART_MON_VBUS == 1)
#define USBUART_VBUS_DR                    ((reg8 *) USBUART_VBUS__DR)
#define USBUART_VBUS_PS                    ((reg8 *) USBUART_VBUS__PS)
#define USBUART_VBUS_MASK                  USBUART_VBUS__MASK
#endif

/************************************************
 *  Constants for USBUART API. 
 ************************************************/
#define USBUART_TRUE                       1
#define USBUART_FALSE                      0

#define USBUART_NO_EVENT_ALLOWED           2
#define USBUART_EVENT_PENDING              1
#define USBUART_NO_EVENT_PENDING           0

#define USBUART_IN_BUFFER_FULL             USBUART_NO_EVENT_PENDING
#define USBUART_IN_BUFFER_EMPTY            USBUART_EVENT_PENDING
#define USBUART_OUT_BUFFER_FULL            USBUART_EVENT_PENDING
#define USBUART_OUT_BUFFER_EMPTY           USBUART_NO_EVENT_PENDING

#define USBUART_FORCE_J                    0xA0
#define USBUART_FORCE_K                    0x80
#define USBUART_FORCE_SE0                  0xC0
#define USBUART_FORCE_NONE                 0x00

#define USBUART_IDLE_TIMER_RUNNING         0x02
#define USBUART_IDLE_TIMER_EXPIRED         0x01
#define USBUART_IDLE_TIMER_INDEFINITE      0x00

#define USBUART_DEVICE_STATUS_BUS_POWERED  0x00
#define USBUART_DEVICE_STATUS_SELF_POWERED 0x01

#define USBUART_3V_OPERATION               0x02
#define USBUART_5V_OPERATION               0x03

#define USBUART_MODE_DISABLE               0x00
#define	USBUART_MODE_NAK_IN_OUT            0x01
#define	USBUART_MODE_STATUS_OUT_ONLY       0x02
#define	USBUART_MODE_STALL_IN_OUT          0x03
#define	USBUART_MODE_RESERVED_0100         0x04
#define	USBUART_MODE_ISO_OUT               0x05
#define	USBUART_MODE_STATUS_IN_ONLY        0x06
#define	USBUART_MODE_ISO_IN                0x07
#define	USBUART_MODE_NAK_OUT               0x08
#define	USBUART_MODE_ACK_OUT               0x09
#define	USBUART_MODE_RESERVED_1010         0x0A
#define	USBUART_MODE_ACK_OUT_STATUS_IN     0x0B
#define	USBUART_MODE_NAK_IN                0x0C
#define	USBUART_MODE_ACK_IN                0x0D
#define	USBUART_MODE_RESERVED_1110         0x0E
#define	USBUART_MODE_ACK_IN_STATUS_OUT     0x0F
#define	USBUART_MODE_STALL_DATA_EP         0x80

#define USBUART_MODE_ACKD                  0x10
#define USBUART_MODE_OUT_RCVD              0x20
#define USBUART_MODE_IN_RCVD               0x40
#define USBUART_MODE_SETUP_RCVD            0x80

#define USBUART_RQST_TYPE_MASK             0x60
#define USBUART_RQST_TYPE_STD              0x00
#define USBUART_RQST_TYPE_CLS              0x20
#define USBUART_RQST_TYPE_VND              0x40
#define USBUART_RQST_DIR_MASK              0x80
#define USBUART_RQST_DIR_D2H               0x80
#define USBUART_RQST_DIR_H2D               0x00
#define USBUART_RQST_RCPT_MASK             0x03
#define USBUART_RQST_RCPT_DEV              0x00
#define USBUART_RQST_RCPT_IFC              0x01
#define USBUART_RQST_RCPT_EP               0x02
#define USBUART_RQST_RCPT_OTHER            0x03

/************************************************
 *  Standard Request Types (Table 9-4) 
 ************************************************/
#define USBUART_GET_STATUS           0x00
#define USBUART_CLEAR_FEATURE        0x01
#define USBUART_SET_FEATURE          0x03
#define USBUART_SET_ADDRESS          0x05
#define USBUART_GET_DESCRIPTOR       0x06
#define USBUART_SET_DESCRIPTOR       0x07
#define USBUART_GET_CONFIGURATION    0x08
#define USBUART_SET_CONFIGURATION    0x09
#define USBUART_GET_INTERFACE        0x0A
#define USBUART_SET_INTERFACE        0x0B
#define USBUART_SYNCH_FRAME          0x0C

/************************************************
 *  Vendor Specific Request Types 
 ************************************************/
 /*Request for Microsoft OS String Descriptor*/
#define USBUART_GET_CONFIG_DESCRIPTOR 0x01
/************************************************
 *  Descriptor Types (Table 9-5) 
 ************************************************/

#define USBUART_DESCR_DEVICE           1
#define USBUART_DESCR_CONFIG           2
#define USBUART_DESCR_STRING           3
#define USBUART_DESCR_INTERFACE        4
#define USBUART_DESCR_ENDPOINT         5
#define USBUART_DESCR_DEVICE_QUALIFIER 6
#define USBUART_DESCR_OTHER_SPEED      7
#define USBUART_DESCR_INTERFACE_POWER  8

/************************************************
 *  Device Descriptor Shifts 
 ************************************************/
#define USBUART_DEVICE_DESCR_SN_SHIFT	16

/************************************************
 *  Feature Selectors (Table 9-6)
 ************************************************/
#define USBUART_DEVICE_REMOTE_WAKEUP    0x01
#define USBUART_ENDPOINT_HALT           0x00
#define USBUART_TEST_MODE               0x02

/************************************************
 *  USB Device Status (Figure 9-4)
 ************************************************/
#define USBUART_DEVICE_STATUS_BUS_POWERED   0x00
#define USBUART_DEVICE_STATUS_SELF_POWERED  0x01
#define USBUART_DEVICE_STATUS_REMOTE_WAKEUP 0x02

/************************************************
 *  USB Endpoint Status (Figure 9-4)
 ************************************************/
#define USBUART_ENDPOINT_STATUS_HALT        0x01

/************************************************
 *  USB Endpoint Directions 
 ************************************************/
#define USBUART_DIR_IN                          0x80
#define USBUART_DIR_OUT                         0x00
#define USBUART_DIR_UNUSED                      0x7F
/************************************************
 *  USB Endpoint Attributes 
 ************************************************/
#define USBUART_EP_TYPE_CTRL                    0x00
#define USBUART_EP_TYPE_ISOC                    0x01
#define USBUART_EP_TYPE_BULK                    0x02
#define USBUART_EP_TYPE_INT                     0x03
#define USBUART_EP_TYPE_MASK                    0x03

#define USBUART_EP_SYNC_TYPE_NO_SYNC            0x00
#define USBUART_EP_SYNC_TYPE_ASYNC              0x04
#define USBUART_EP_SYNC_TYPE_ADAPTIVE           0x08
#define USBUART_EP_SYNC_TYPE_SYNCHRONOUS        0x0C
#define USBUART_EP_SYNC_TYPE_MASK               0x0C

