MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\USBUART.h
#define USBUART_EP_USAGE_TYPE_DATA              0x00
#define USBUART_EP_USAGE_TYPE_FEEDBACK          0x10
#define USBUART_EP_USAGE_TYPE_IMPLICIT          0x20
#define USBUART_EP_USAGE_TYPE_RESERVED          0x30
#define USBUART_EP_USAGE_TYPE_MASK              0x30

/************************************************
 *  Transfer Completion Notification 
 ************************************************/
#define USBUART_XFER_IDLE                       0x00
#define USBUART_XFER_STATUS_ACK                 0x01
#define USBUART_XFER_PREMATURE                  0x02
#define USBUART_XFER_ERROR                      0x03

/*******************************************************************************
* Driver State defines
********************************************************************************/
#define USBUART_TRANS_STATE_IDLE             0x00
#define USBUART_TRANS_STATE_CONTROL_READ     0x02
#define USBUART_TRANS_STATE_CONTROL_WRITE    0x04
#define USBUART_TRANS_STATE_NO_DATA_CONTROL  0x06

/************************************************
 *  USB, ARB, SIE register definitions 
 ************************************************/
#define USBUART_ARB_CFG        ((reg8 *) USBUART_USB__ARB_CFG)

#define USBUART_ARB_EP1_CFG    ((reg8 *) USBUART_USB__ARB_EP1_CFG)
#define USBUART_ARB_EP1_INT_EN ((reg8 *) USBUART_USB__ARB_EP1_INT_EN)
#define USBUART_ARB_EP1_SR     ((reg8 *) USBUART_USB__ARB_EP1_SR)

#define USBUART_ARB_EP2_CFG    ((reg8 *) USBUART_USB__ARB_EP2_CFG)
#define USBUART_ARB_EP2_INT_EN ((reg8 *) USBUART_USB__ARB_EP2_INT_EN)
#define USBUART_ARB_EP2_SR     ((reg8 *) USBUART_USB__ARB_EP2_SR)

#define USBUART_ARB_EP3_CFG    ((reg8 *) USBUART_USB__ARB_EP3_CFG)
#define USBUART_ARB_EP3_INT_EN ((reg8 *) USBUART_USB__ARB_EP3_INT_EN)
#define USBUART_ARB_EP3_SR     ((reg8 *) USBUART_USB__ARB_EP3_SR)

#define USBUART_ARB_EP4_CFG    ((reg8 *) USBUART_USB__ARB_EP4_CFG)
#define USBUART_ARB_EP4_INT_EN ((reg8 *) USBUART_USB__ARB_EP4_INT_EN)
#define USBUART_ARB_EP4_SR     ((reg8 *) USBUART_USB__ARB_EP4_SR)

#define USBUART_ARB_EP5_CFG    ((reg8 *) USBUART_USB__ARB_EP5_CFG)
#define USBUART_ARB_EP5_INT_EN ((reg8 *) USBUART_USB__ARB_EP5_INT_EN)
#define USBUART_ARB_EP5_SR     ((reg8 *) USBUART_USB__ARB_EP5_SR)

#define USBUART_ARB_EP6_CFG    ((reg8 *) USBUART_USB__ARB_EP6_CFG)
#define USBUART_ARB_EP6_INT_EN ((reg8 *) USBUART_USB__ARB_EP6_INT_EN)
#define USBUART_ARB_EP6_SR     ((reg8 *) USBUART_USB__ARB_EP6_SR)

#define USBUART_ARB_EP7_CFG    ((reg8 *) USBUART_USB__ARB_EP7_CFG)
#define USBUART_ARB_EP7_INT_EN ((reg8 *) USBUART_USB__ARB_EP7_INT_EN)
#define USBUART_ARB_EP7_SR     ((reg8 *) USBUART_USB__ARB_EP7_SR)

#define USBUART_ARB_EP8_CFG    ((reg8 *) USBUART_USB__ARB_EP8_CFG)
#define USBUART_ARB_EP8_INT_EN ((reg8 *) USBUART_USB__ARB_EP8_INT_EN)
#define USBUART_ARB_EP8_SR     ((reg8 *) USBUART_USB__ARB_EP8_SR)

#define USBUART_ARB_INT_EN     ((reg8 *) USBUART_USB__ARB_INT_EN)
#define USBUART_ARB_INT_SR     ((reg8 *) USBUART_USB__ARB_INT_SR)

#define USBUART_ARB_RW1_DR     ((reg8 *) USBUART_USB__ARB_RW1_DR)
#define USBUART_ARB_RW1_RA     ((reg8 *) USBUART_USB__ARB_RW1_RA)
#define USBUART_ARB_RW1_RA_MSB ((reg8 *) USBUART_USB__ARB_RW1_RA_MSB)
#define USBUART_ARB_RW1_WA     ((reg8 *) USBUART_USB__ARB_RW1_WA)
#define USBUART_ARB_RW1_WA_MSB ((reg8 *) USBUART_USB__ARB_RW1_WA_MSB)

#define USBUART_ARB_RW2_DR     ((reg8 *) USBUART_USB__ARB_RW2_DR)
#define USBUART_ARB_RW2_RA     ((reg8 *) USBUART_USB__ARB_RW2_RA)
#define USBUART_ARB_RW2_RA_MSB ((reg8 *) USBUART_USB__ARB_RW2_RA_MSB)
#define USBUART_ARB_RW2_WA     ((reg8 *) USBUART_USB__ARB_RW2_WA)
#define USBUART_ARB_RW2_WA_MSB ((reg8 *) USBUART_USB__ARB_RW2_WA_MSB)

#define USBUART_ARB_RW3_DR     ((reg8 *) USBUART_USB__ARB_RW3_DR)
#define USBUART_ARB_RW3_RA     ((reg8 *) USBUART_USB__ARB_RW3_RA)
#define USBUART_ARB_RW3_RA_MSB ((reg8 *) USBUART_USB__ARB_RW3_RA_MSB)
#define USBUART_ARB_RW3_WA     ((reg8 *) USBUART_USB__ARB_RW3_WA)
#define USBUART_ARB_RW3_WA_MSB ((reg8 *) USBUART_USB__ARB_RW3_WA_MSB)

#define USBUART_ARB_RW4_DR     ((reg8 *) USBUART_USB__ARB_RW4_DR)
#define USBUART_ARB_RW4_RA     ((reg8 *) USBUART_USB__ARB_RW4_RA)
#define USBUART_ARB_RW4_RA_MSB ((reg8 *) USBUART_USB__ARB_RW4_RA_MSB)
#define USBUART_ARB_RW4_WA     ((reg8 *) USBUART_USB__ARB_RW4_WA)
#define USBUART_ARB_RW4_WA_MSB ((reg8 *) USBUART_USB__ARB_RW4_WA_MSB)

#define USBUART_ARB_RW5_DR     ((reg8 *) USBUART_USB__ARB_RW5_DR)
#define USBUART_ARB_RW5_RA     ((reg8 *) USBUART_USB__ARB_RW5_RA)
#define USBUART_ARB_RW5_RA_MSB ((reg8 *) USBUART_USB__ARB_RW5_RA_MSB)
#define USBUART_ARB_RW5_WA     ((reg8 *) USBUART_USB__ARB_RW5_WA)
#define USBUART_ARB_RW5_WA_MSB ((reg8 *) USBUART_USB__ARB_RW5_WA_MSB)

#define USBUART_ARB_RW6_DR     ((reg8 *) USBUART_USB__ARB_RW6_DR)
#define USBUART_ARB_RW6_RA     ((reg8 *) USBUART_USB__ARB_RW6_RA)
#define USBUART_ARB_RW6_RA_MSB ((reg8 *) USBUART_USB__ARB_RW6_RA_MSB)
#define USBUART_ARB_RW6_WA     ((reg8 *) USBUART_USB__ARB_RW6_WA)
#define USBUART_ARB_RW6_WA_MSB ((reg8 *) USBUART_USB__ARB_RW6_WA_MSB)

#define USBUART_ARB_RW7_DR     ((reg8 *) USBUART_USB__ARB_RW7_DR)
#define USBUART_ARB_RW7_RA     ((reg8 *) USBUART_USB__ARB_RW7_RA)
#define USBUART_ARB_RW7_RA_MSB ((reg8 *) USBUART_USB__ARB_RW7_RA_MSB)
#define USBUART_ARB_RW7_WA     ((reg8 *) USBUART_USB__ARB_RW7_WA)
#define USBUART_ARB_RW7_WA_MSB ((reg8 *) USBUART_USB__ARB_RW7_WA_MSB)

#define USBUART_ARB_RW8_DR     ((reg8 *) USBUART_USB__ARB_RW8_DR)
#define USBUART_ARB_RW8_RA     ((reg8 *) USBUART_USB__ARB_RW8_RA)
#define USBUART_ARB_RW8_RA_MSB ((reg8 *) USBUART_USB__ARB_RW8_RA_MSB)
#define USBUART_ARB_RW8_WA     ((reg8 *) USBUART_USB__ARB_RW8_WA)
#define USBUART_ARB_RW8_WA_MSB ((reg8 *) USBUART_USB__ARB_RW8_WA_MSB)

#define USBUART_BUF_SIZE       ((reg8 *) USBUART_USB__BUF_SIZE)
#define USBUART_BUS_RST_CNT    ((reg8 *) USBUART_USB__BUS_RST_CNT)
#define USBUART_CR0            ((reg8 *) USBUART_USB__CR0)
#define USBUART_CR1            ((reg8 *) USBUART_USB__CR1)
#define USBUART_CWA            ((reg8 *) USBUART_USB__CWA)
#define USBUART_CWA_MSB        ((reg8 *) USBUART_USB__CWA_MSB)

#define USBUART_DMA_THRES      ((reg8 *) USBUART_USB__DMA_THRES)
#define USBUART_DMA_THRES_MSB  ((reg8 *) USBUART_USB__DMA_THRES_MSB)

#define USBUART_EP_ACTIVE      ((reg8 *) USBUART_USB__EP_ACTIVE)
#define USBUART_EP_TYPE        ((reg8 *) USBUART_USB__EP_TYPE)

