MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\USBUART.h
#define USBUART_EP0_CNT        ((reg8 *) USBUART_USB__EP0_CNT)
#define USBUART_EP0_CR         ((reg8 *) USBUART_USB__EP0_CR)
#define USBUART_EP0_DR0        ((reg8 *) USBUART_USB__EP0_DR0)
#define USBUART_EP0_DR1        ((reg8 *) USBUART_USB__EP0_DR1)
#define USBUART_EP0_DR2        ((reg8 *) USBUART_USB__EP0_DR2)
#define USBUART_EP0_DR3        ((reg8 *) USBUART_USB__EP0_DR3)
#define USBUART_EP0_DR4        ((reg8 *) USBUART_USB__EP0_DR4)
#define USBUART_EP0_DR5        ((reg8 *) USBUART_USB__EP0_DR5)
#define USBUART_EP0_DR6        ((reg8 *) USBUART_USB__EP0_DR6)
#define USBUART_EP0_DR7        ((reg8 *) USBUART_USB__EP0_DR7)

#define USBUART_OSCLK_DR0      ((reg8 *) USBUART_USB__OSCLK_DR0)
#define USBUART_OSCLK_DR1      ((reg8 *) USBUART_USB__OSCLK_DR1)

#define USBUART_PM_ACT_CFG     ((reg8 *) USBUART_USB__PM_ACT_CFG)
#define USBUART_PM_ACT_MSK     ((reg8 *) USBUART_USB__PM_ACT_MSK)
#define USBUART_PM_STBY_CFG    ((reg8 *) USBUART_USB__PM_STBY_CFG)
#define USBUART_PM_STBY_MSK    ((reg8 *) USBUART_USB__PM_STBY_MSK)

#define USBUART_SIE_EP_INT_EN  ((reg8 *) USBUART_USB__SIE_EP_INT_EN)
#define USBUART_SIE_EP_INT_SR  ((reg8 *) USBUART_USB__SIE_EP_INT_SR)

#define USBUART_SIE_EP1_CNT0   ((reg8 *) USBUART_USB__SIE_EP1_CNT0)
#define USBUART_SIE_EP1_CNT1   ((reg8 *) USBUART_USB__SIE_EP1_CNT1)
#define USBUART_SIE_EP1_CR0    ((reg8 *) USBUART_USB__SIE_EP1_CR0)

#define USBUART_SIE_EP2_CNT0   ((reg8 *) USBUART_USB__SIE_EP2_CNT0)
#define USBUART_SIE_EP2_CNT1   ((reg8 *) USBUART_USB__SIE_EP2_CNT1)
#define USBUART_SIE_EP2_CR0    ((reg8 *) USBUART_USB__SIE_EP2_CR0)

#define USBUART_SIE_EP3_CNT0   ((reg8 *) USBUART_USB__SIE_EP3_CNT0)
#define USBUART_SIE_EP3_CNT1   ((reg8 *) USBUART_USB__SIE_EP3_CNT1)
#define USBUART_SIE_EP3_CR0    ((reg8 *) USBUART_USB__SIE_EP3_CR0)

#define USBUART_SIE_EP4_CNT0   ((reg8 *) USBUART_USB__SIE_EP4_CNT0)
#define USBUART_SIE_EP4_CNT1   ((reg8 *) USBUART_USB__SIE_EP4_CNT1)
#define USBUART_SIE_EP4_CR0    ((reg8 *) USBUART_USB__SIE_EP4_CR0)

#define USBUART_SIE_EP5_CNT0   ((reg8 *) USBUART_USB__SIE_EP5_CNT0)
#define USBUART_SIE_EP5_CNT1   ((reg8 *) USBUART_USB__SIE_EP5_CNT1)
#define USBUART_SIE_EP5_CR0    ((reg8 *) USBUART_USB__SIE_EP5_CR0)

#define USBUART_SIE_EP6_CNT0   ((reg8 *) USBUART_USB__SIE_EP6_CNT0)
#define USBUART_SIE_EP6_CNT1   ((reg8 *) USBUART_USB__SIE_EP6_CNT1)
#define USBUART_SIE_EP6_CR0    ((reg8 *) USBUART_USB__SIE_EP6_CR0)

#define USBUART_SIE_EP7_CNT0   ((reg8 *) USBUART_USB__SIE_EP7_CNT0)
#define USBUART_SIE_EP7_CNT1   ((reg8 *) USBUART_USB__SIE_EP7_CNT1)
#define USBUART_SIE_EP7_CR0    ((reg8 *) USBUART_USB__SIE_EP7_CR0)

#define USBUART_SIE_EP8_CNT0   ((reg8 *) USBUART_USB__SIE_EP8_CNT0)
#define USBUART_SIE_EP8_CNT1   ((reg8 *) USBUART_USB__SIE_EP8_CNT1)
#define USBUART_SIE_EP8_CR0    ((reg8 *) USBUART_USB__SIE_EP8_CR0)

#define USBUART_SOF0           ((reg8 *) USBUART_USB__SOF0)
#define USBUART_SOF1           ((reg8 *) USBUART_USB__SOF1)

#define USBUART_USB_CLK_EN     ((reg8 *) USBUART_USB__USB_CLK_EN)

#define USBUART_USBIO_CR0      ((reg8 *) USBUART_USB__USBIO_CR0)
#define USBUART_USBIO_CR1      ((reg8 *) USBUART_USB__USBIO_CR1)
#define USBUART_USBIO_CR2      ((reg8 *) USBUART_USB__USBIO_CR2)

#define USBUART_USB_MEM        ((reg8 *) CYDEV_USB_MEM_BASE)

#if(CYDEV_CHIP_DIE_EXPECT == CYDEV_CHIP_DIE_LEOPARD)
    /* PSoC3 interrupt registers*/
    #define USBUART_USB_ISR_PRIOR  ((reg8 *) CYDEV_INTC_PRIOR0)
    #define USBUART_USB_ISR_SET_EN ((reg8 *) CYDEV_INTC_SET_EN0)
    #define USBUART_USB_ISR_CLR_EN ((reg8 *) CYDEV_INTC_CLR_EN0)
    #define USBUART_USB_ISR_VECT   ((cyisraddress *) CYDEV_INTC_VECT_MBASE)
#else
#if(CYDEV_CHIP_DIE_EXPECT == CYDEV_CHIP_DIE_PANTHER)
    /* PSoC5 interrupt registers*/ 
    #define USBUART_USB_ISR_PRIOR  ((reg8 *) CYDEV_NVIC_PRI_0)
    #define USBUART_USB_ISR_SET_EN ((reg8 *) CYDEV_NVIC_SETENA0)
    #define USBUART_USB_ISR_CLR_EN ((reg8 *) CYDEV_NVIC_CLRENA0)
    #define USBUART_USB_ISR_VECT   ((cyisraddress *) CYDEV_NVIC_VECT_OFFSET)
#endif
#endif

/************************************************
 *  Interrupt vectors, masks and priorities 
 ************************************************/
#define USBUART_BUS_RESET_PRIOR     USBUART_bus_reset__INTC_PRIOR_NUM
#define USBUART_BUS_RESET_MASK      USBUART_bus_reset__INTC_MASK
#define USBUART_BUS_RESET_VECT_NUM  USBUART_bus_reset__INTC_NUMBER
 
#define USBUART_SOF_PRIOR     USBUART_sof_int__INTC_PRIOR_NUM 
#define USBUART_SOF_MASK      USBUART_sof_int__INTC_MASK
#define USBUART_SOF_VECT_NUM  USBUART_sof_int__INTC_NUMBER
 
#define USBUART_EP_0_PRIOR     USBUART_ep_0__INTC_PRIOR_NUM
#define USBUART_EP_0_MASK      USBUART_ep_0__INTC_MASK
#define USBUART_EP_0_VECT_NUM  USBUART_ep_0__INTC_NUMBER
 
#define USBUART_EP_1_PRIOR     USBUART_ep_1__INTC_PRIOR_NUM 
#define USBUART_EP_1_MASK      USBUART_ep_1__INTC_MASK
#define USBUART_EP_1_VECT_NUM  USBUART_ep_1__INTC_NUMBER
 
#define USBUART_EP_2_PRIOR     USBUART_ep_2__INTC_PRIOR_NUM 
#define USBUART_EP_2_MASK      USBUART_ep_2__INTC_MASK
#define USBUART_EP_2_VECT_NUM  USBUART_ep_2__INTC_NUMBER
 
#define USBUART_EP_3_PRIOR     USBUART_ep_3__INTC_PRIOR_NUM
#define USBUART_EP_3_MASK      USBUART_ep_3__INTC_MASK
#define USBUART_EP_3_VECT_NUM  USBUART_ep_3__INTC_NUMBER
 
#define USBUART_EP_4_PRIOR     USBUART_ep_4__INTC_PRIOR_NUM 
#define USBUART_EP_4_MASK      USBUART_ep_4__INTC_MASK
#define USBUART_EP_4_VECT_NUM  USBUART_ep_4__INTC_NUMBER
 
#define USBUART_EP_5_PRIOR     USBUART_ep_5__INTC_PRIOR_NUM
#define USBUART_EP_5_MASK      USBUART_ep_5__INTC_MASK
#define USBUART_EP_5_VECT_NUM  USBUART_ep_5__INTC_NUMBER
 
#define USBUART_EP_6_PRIOR     USBUART_ep_6__INTC_PRIOR_NUM
#define USBUART_EP_6_MASK      USBUART_ep_6__INTC_MASK
#define USBUART_EP_6_VECT_NUM  USBUART_ep_6__INTC_NUMBER
 
#define USBUART_EP_7_PRIOR     USBUART_ep_7__INTC_PRIOR_NUM 
#define USBUART_EP_7_MASK      USBUART_ep_7__INTC_MASK
#define USBUART_EP_7_VECT_NUM  USBUART_ep_7__INTC_NUMBER
 
#define USBUART_EP_8_PRIOR     USBUART_ep_8__INTC_PRIOR_NUM
#define USBUART_EP_8_MASK      USBUART_ep_8__INTC_MASK
#define USBUART_EP_8_VECT_NUM  USBUART_ep_8__INTC_NUMBER
 
/************************************************
 *  Register Masks 
 ************************************************/
#define USBUART_CR1_REG_ENABLE             0x01u
#define USBUART_CR1_ENABLE_LOCK            0x02u
#define USBUART_CR1_BUS_ACTIVITY           0x04u
#define USBUART_EP0_CNT_DATA_TOGGLE        0x80u
#define USBUART_EPX_CNT_DATA_TOGGLE        0x80u
#define USBUART_EPX_CNT0_MASK              0x07u
#define USBUART_CR0_ENABLE                 0x80u

#define USBUART_USBIO_CR1_IOMODE           0x80u
#define USBUART_USBIO_CR1_DRIVE_MODE       0x40u
#define USBUART_USBIO_CR1_DPI              0x20u
#define USBUART_USBIO_CR1_DMI              0x10u
#define USBUART_USBIO_CR1_P2PUEN           0x08u
#define USBUART_USBIO_CR1_USBPUEN          0x04u
#define USBUART_USBIO_CR1_DP0              0x02u
#define USBUART_USBIO_CR1_DM0              0x01u

#define USBUART_FASTCLK_IMO_CR_USBCLK_ON   0x40u
#define USBUART_FASTCLK_IMO_CR_XCLKEN      0x20u
#define USBUART_FASTCLK_IMO_CR_FX2ON       0x10u

#define USBUART_ARB_EPX_CFG_RESET_PTR      0x08u
#define USBUART_ARB_EPX_CFG_CRC_BYPASS     0x04u
#define USBUART_ARB_EPX_CFG_DMA_REQ        0x02u
#define USBUART_ARB_EPX_CFG_IN_DATA_RDY    0x01u

/************************************************
 *  Endpoint 0 offsets (Table 9-2) 
 ************************************************/

#define USBUART_bmRequestType   USBUART_EP0_DR0
#define USBUART_bRequest        USBUART_EP0_DR1
#define USBUART_wValue          USBUART_EP0_DR2
#define USBUART_wValueHi        USBUART_EP0_DR3
#define USBUART_wValueLo        USBUART_EP0_DR2
#define USBUART_wIndex          USBUART_EP0_DR4
#define USBUART_wIndexHi        USBUART_EP0_DR5
#define USBUART_wIndexLo        USBUART_EP0_DR4
#define USBUART_wLength         USBUART_EP0_DR6
#define USBUART_wLengthHi       USBUART_EP0_DR7
#define USBUART_wLengthLo       USBUART_EP0_DR6

