MaurinElectroTextile/Active_matrix/Proto_2_v_3_1.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\USBUART.h
#define TRUE  1
#define FALSE 0
/************************************************
 *  Optional Features 
 ************************************************/


#if (USBUART_MON_VBUS == 1)
#define USBUART_VBUS_DR        ((reg8 *) USBUART_VBUS__DR)
#define USBUART_VBUS_PS        ((reg8 *) USBUART_VBUS__PS)
#define USBUART_VBUS_MASK      USBUART_VBUS__MASK
#endif

/*******************************************************************************
* typedefs
********************************************************************************/
typedef struct {
    uint8  bAttrib;
    uint8  bAPIEPState;
    uint8  bHWEPState;
    uint8  bEPToggle;
    uint8  bAddr;
    uint8  bEPMode;
    uint16 wBuffOffset;
    uint16 wBufferSize;
} T_USBUART_EP_CTL_BLOCK;

typedef struct {
    uint8  bInterface;
    uint8  bAltSetting;
    uint8  bAddr;
    uint8  bmAttributes;
    uint16 wBufferSize;
	uint8  bMisc;
} T_USBUART_EP_SETTINGS_BLOCK;

typedef struct {
    uint8  bStatus;
    uint16 wLength;
} T_USBUART_XFER_STATUS_BLOCK;

typedef struct {
    uint16  wCount;
    uint8   *pData;
    T_USBUART_XFER_STATUS_BLOCK *pStatusBlock;
} T_USBUART_TD;

typedef struct {
    uint8   c;
    void    *p_list;
} T_USBUART_LUT;

/************************************************
 *  Prototypes of the USBUART API. 
 ************************************************/
extern void   USBUART_Start(uint8 bDevice, uint8 bMode);
extern void   USBUART_Stop(void);
extern uint8  USBUART_bCheckActivity(void);
extern uint8  USBUART_bGetConfiguration(void);
uint8  USBUART_bGetInterfaceSetting(uint8 ifc);
extern uint8  USBUART_bGetEPState(uint8 bEPNumber);
extern uint16 USBUART_wGetEPCount(uint8 bEPNumber);
extern void   USBUART_LoadEP(uint8 bEPNumber, uint8 *pData, uint16 wLength);
extern uint16 USBUART_ReadOutEP(uint8 bEPNumber, uint8 *pData, uint16 wLength);
extern void   USBUART_EnableOutEP(uint8 bEPNumber);
extern void   USBUART_DisableOutEP(uint8 bEPNumber);
extern void   USBUART_Force(uint8 bState);
extern uint8  USBUART_bGetEPAckState(uint8 bEPNumber);
extern void   USBUART_SetPowerStatus(uint8 bPowerStaus);
extern uint8  USBUART_bRWUEnabled(void);
extern void  USBUART_SerialNumString(uint8 *SNstring);


#define USBUART_LoadInEP(e, p, l)        USBUART_LoadEP(e, p, l)
#define USBUART_LoadInISOCEP(e, p, l)    USBUART_LoadEP(e, p, l)
#define USBUART_EnableOutISOCEP(e)       USBUART_EnableOutEP(e)

#if (USBUART_MON_VBUS == 1)
extern uint8  USBUART_bVBusPresent(void);
#endif

#endif
